Repository: Hikmatullohprogramist/user_pharmacy_test1
Catalog: ios/Runner/*.lproj/InfoPlist.strings
Languages: ru, uz

# NSAppleMusicUsageDescription
source: Play using while you are hiking
ru: Пользуйтесь игрой во время пешего похода
uz: Yurib ketayotganda ham foydalaning

# NSCalendarsUsageDescription
source: This app wants to access calendar
ru: Это приложение требует доступа к календарю.
uz: Bu ilova uchun kalendar ishlatishga ruxsat kerak.

# NSCameraUsageDescription
source: In the app we have used camera to scan the barcode of the products to search by barcode number.
ru: В приложении мы использовали камеру для сканирования штрих-кода продуктов для поиска по номеру штрих-кода.
uz: Ilovada shtrix kod raqami bilan qidirish uchun mahsulotlarning shtrix kodini skanerlash uchun kameradan foydalanildi.

# NSContactsUsageDescription
source: Application wants to access your contacts list.
ru: Приложение требует получить доступ к вашему списку контактов.
uz: Ilova uchun kontaktlar ro'yxatiga ruxsat kerak.

# NSLocationWhenInUseUsageDescription
source: In the app there is order section where user chooses his/her location for shipping information.
ru: В приложении есть раздел заказа, где пользователь выбирает свое местоположение для получения информации о доставке.
uz: Ilovada buyurtmalar bo'limida yetkazib berish xizmati uchun foydalanuvchi qayerda turganligini (geolokatsiya) tanlashi kerak bo'ladi.

# NSMicrophoneUsageDescription
source: In the search section of the app there is a search by voice. So, app needs microphone to allow user use the voice search.
ru: В разделе поиска приложения есть поиск по голосу. Таким образом, приложение нуждается в микрофоне, чтобы позволить пользователю использовать голосовой поиск.
uz: Ilovaning qidiruv bo'limida ovoz orqali qidirish uchun ilovaga mikrofondan foydalanishga ruxsat kerak.

# NSMotionUsageDescription
source: This app wants to access motion use.
ru: Это приложение требует доступа к использованию движения.
uz: Bu ilovaga telefonning harakatlanishidan foydalanishga ruxsat kerak.

# NSSpeechRecognitionUsageDescription
source: In the search section of the app there is a search by voice. App uses speech recognition to recognize what the user searching for. Speech recognition translates the speech in to the text to search.
ru: В разделе поиска приложения есть поиск по голосу. Приложение использует распознавание речи, чтобы распознать то, что ищет пользователь. Распознавание речи переводит речь в текст для поиска.
uz: Ilovaning qidiruv bo'limida ovoz orqali qidirish uchun ilova nutq tanib olish (speech recognition)dan foydalanadi. Bu xususiyat nutqni qidirish uchun yozuv holiga o'tkazib beradi.

# NSBluetoothAlwaysUsageDescription
source: This app wants to access bluetooth
ru: Это приложение требует доступа к блютуз
uz: Bu ilova uchun bluetooth ishlatishga ruxsat kerak.

# NSBluetoothPeripheralUsageDescription
source: This app wants to access bluetooth
ru: Это приложение требует доступа к блютуз
uz: Bu ilova uchun bluetooth ishlatishga ruxsat kerak.

# NSLocationAlwaysUsageDescription
source: In the app there is order section where user chooses his/her location for shipping information.
ru: В приложении есть раздел заказа, где пользователь выбирает свое местоположение для получения информации о доставке.
uz: Ilovada buyurtmalar bo'limida yetkazib berish xizmati uchun foydalanuvchi qayerda turganligini (geolokatsiya) tanlashi kerak bo'ladi.
